Revit 2024 API
MacroModuleIterator.IsDone Method
 Identifies if the iteration has completed.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public virtual bool IsDone()
Visual Basic
Public Overridable Function IsDone As Boolean
Visual C++
public:
virtual bool IsDone()
Return Value
 True if the iteration has no more items. False if there are more items to be iterated.
See Also
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace